Tekla Open API Reference for Tekla Structures 2025
ControlArc Constructor
 Creates a new control arc instance.
The default values are as follows:
CenterPoint = Point(0.0, 0.0, 0.0);
StartPoint = Point(0.0, 1000.0, 0.0);
EndPoint = Point(1000.0, 0.0, 0.0);
Color = ControlObjectColorEnum.YELLOW;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlArc()
Public Sub New
See Also
Reference
ControlArc Class
ControlArc Overload
Tekla.Structures.Model Namespace